import re
import yaml

trans_tables = { 
    'isv_to_slovianto': 'ě-e y-i',
    'isv_to_standard': 'ć-č ć-č ć-č ś-s ź-z ŕ-r ĺ-l ľ-l ń-n t́-t ť-t d́-d ď-d đ-dž ò-o ȯ-o ė-e è-e č-č š-š ž-ž ě-ě е̌-ě å-a ę-e ų-u',
#   'isv_to_cyrillic': 'ń-нь nj-њ lj-љ ĺ-ль ľ-ль ć-ч ć-ч ć-ч ś-с ź-з ŕ-р t́-т ť-т d́-д ď-д đ-дж ò-о ȯ-о ė-е è-е č-ч š-ш ž-ж ě-є е̌-є ě-є å-а ę-е ų-у a-а b-б c-ц č-ч d-д e-е f-ф g-г h-х i-и j-ј k-к l-л m-м n-н o-о p-п r-р s-с š-ш t-т u-у v-в y-ы z-з ž-ж',
    'isv_to_cyrillic': 'ń-н ľ-л nj-њ lj-љ ć-ч ć-ч ć-ч ś-с ź-з ŕ-р t́-т ť-т d́-д ď-д đ-дж ò-о ȯ-о ė-е è-е č-ч š-ш ž-ж ě-є е̌-є ě-є å-а ę-е ų-у a-а b-б c-ц č-ч d-д e-е f-ф g-г h-х i-и j-ј k-к l-л m-м n-н o-о p-п r-р s-с š-ш t-т u-у v-в y-ы z-з ž-ж',

    'ru': 'ё-е а́-а е́-е и́-и о́-о у́-у ы́-ы э́-э ю́-ю я́-я',
    'uk': 'ґ-г а́-а е́-е и́-и о́-о у́-у ы́-ы є́-є ю́-ю я́-я і́-і ї́-ї',  
    'be': 'ґ-г а́-а е́-е и́-и о́-о у́-у ы́-ы э́-э ю́-ю я́-я і́-і',  
    'bg': 'ѝ-и',
    'mk': 'ѝ-и ѐ-е',
    'kir_to_lat': 'ньј-ńj ь- а-a ӑ-å б-b в-v ў-v г-g ґ-g д-d дж-dž ђ-dž е-e є-ě ѣ-ě ж-ž з-z и-i ј-j ї-ji й-j к-k л-l љ-lj м-m н-n њ-nj о-o п-p р-r с-s т-t у-u ф-f х-h ц-c ч-č ш-š щ-šč ъ-ȯ ы-y ю-ju я-ja ё-e ѫ-ų ѧ-ę ћ-ć ѥ-je ꙑ-y',     
    'kirilicna_zamena': 'ру-ru бе-be ук-uk бг-bg мк-mk ср-sr ua-uk cz-cs ms-isv мс-isv обнови-obnovi',
}


def transliteration(text, lang):
    if lang not in trans_tables.keys():
        return text
    replaces = trans_tables[lang] 
    if not text.islower():
        replaces = replaces + " " + trans_tables[lang].upper()
    for i in replaces.split(' '):
        letters = i.split('-')
        text = text.replace(letters[0], letters[1])
    return text

with open('pouky.yaml', encoding="UTF-8") as fh:
    pouky_data = yaml.load(fh, Loader=yaml.FullLoader)

def transliteration2(text, lang='kir_to_lat'):
    series = re.split(r"`", text)
    for i in range(0, len(series), 2):
        series[i] = transliteration(series[i], lang)
    return '`'.join(series)

# text = pouky_data['pouka7']['text']
# result = transliteration2(text, 'kir_to_lat')



# from pprint import pprint
# pouky_latin = {}
# for key in pouky_data.keys():
#     pouky_latin[key] = transliteration2(pouky_data[key]['text'], 'kir_to_lat')

# print(pouky_latin["pouka7"])

# Словари для транслитерации
# Словари для транслитерации
# char_maps = {
#         ("isv", "ru"): {'a': 'а', 'b': 'б', 'c': 'ц', 'č': 'ч', 'ć': 'чь', 'd': 'д', 'ď': 'дь', 'd́': 'дь', 'e': 'е',
#                         'ě': 'є', 'ė': 'е', 'ę': 'я', 'ě': 'е', 'f': 'ф', 'g': 'г', 'h': 'х', 'i': 'и', 'j': 'й',
#                         'k': 'к', 'l': 'л', 'ľ': 'ль', 'ĺ': 'ль', 'm': 'м', 'n': 'н', 'ń': 'нь', 'o': 'о', 'p': 'п',
#                         'r': 'р', 's': 'с', 'š': 'ш', 'ś': 'сь', 't': 'т', 'ť': 'ть', 'u': 'у', 'v': 'в', 'y': 'ы',
#                         'z': 'з', 'ž': 'ж', 'ź': 'зь', 'å': 'а', 'ȯ': 'о', 'ò': 'о', 'ó': 'о', 'ú': 'у', 'ý': 'ы'},
#         ("isv", "uk"): {'a': 'а', 'b': 'б', 'c': 'ц', 'č': 'ч', 'ć': 'чь', 'd': 'д', 'ď': 'дь', 'd́': 'дь', 'e': 'е',
#                         'ě': 'є', 'ė': 'е', 'ę': 'я', 'ě': 'ї', 'f': 'ф', 'g': 'ґ', 'h': 'г', 'i': 'і', 'j': 'й',
#                         'k': 'к', 'l': 'л', 'ľ': 'ль', 'ĺ': 'ль', 'm': 'м', 'n': 'н', 'ń': 'нь', 'o': 'о', 'p': 'п',
#                         'r': 'р', 's': 'с', 'š': 'ш', 'ś': 'сь', 't': 'т', 'ť': 'ть', 'u': 'у', 'v': 'в', 'y': 'и',
#                         'z': 'з', 'ž': 'ж', 'ź': 'зь', 'å': 'а', 'ȯ': 'о', 'ò': 'о', 'ó': 'о', 'ú': 'у', 'ý': 'і'},
#         ("isv", "pl"): {'a': 'a', 'b': 'b', 'c': 'c', 'č': 'cz', 'ć': 'ć', 'd': 'd', 'ď': 'd', 'd́': 'd', 'e': 'e',
#                         'ě': 'e', 'ė': 'e', 'ę': 'ę', 'ě': 'ie', 'f': 'f', 'g': 'g', 'h': 'ch', 'i': 'i', 'j': 'j',
#                         'k': 'k', 'l': 'ł', 'ľ': 'l', 'ĺ': 'l', 'm': 'm', 'n': 'n', 'ń': 'ń', 'o': 'o', 'p': 'p',
#                         'r': 'r', 's': 's', 'š': 'sz', 'ś': 'ś', 't': 't', 'ť': 't', 'u': 'u', 'v': 'w', 'y': 'y',
#                         'z': 'z', 'ž': 'ż', 'ź': 'ź', 'å': 'a', 'ȯ': 'o', 'ò': 'o', 'ó': 'o', 'ú': 'u', 'ý': 'y'},
#         ("isv", "cs"): {'a': 'a', 'b': 'b', 'c': 'c', 'č': 'č', 'ć': 'č', 'd': 'd', 'ď': 'ď', 'd́': 'ď', 'e': 'e',
#                         'ě': 'e', 'ė': 'e', 'ę': 'e', 'ě': 'ě', 'f': 'f', 'g': 'g', 'h': 'h', 'i': 'i', 'j': 'j',
#                         'k': 'k', 'l': 'l', 'ľ': 'l', 'ĺ': 'l', 'm': 'm', 'n': 'n', 'ń': 'ň', 'o': 'o', 'p': 'p',
#                         'r': 'r', 's': 's', 'š': 'š', 'ś': 'š', 't': 't', 'ť': 'ť', 'u': 'u', 'v': 'v', 'y': 'y',
#                         'z': 'z', 'ž': 'ž', 'ź': 'ž', 'å': 'a', 'ȯ': 'o', 'ò': 'o', 'ó': 'o', 'ú': 'u', 'ý': 'y'},
#         ("isv", "bg"): {'a': 'а', 'b': 'б', 'c': 'ц', 'č': 'ч', 'ć': 'ч', 'd': 'д', 'ď': 'д', 'd́': 'д', 'e': 'е',
#                         'ě': 'е', 'ė': 'е', 'ę': 'ъ', 'ě': 'е', 'f': 'ф', 'g': 'г', 'h': 'х', 'i': 'и', 'j': 'й',
#                         'k': 'к', 'l': 'л', 'ľ': 'ль', 'ĺ': 'ль', 'm': 'м', 'n': 'н', 'ń': 'нь', 'o': 'о', 'p': 'п',
#                         'r': 'р', 's': 'с', 'š': 'ш', 'ś': 'с', 't': 'т', 'ť': 'т', 'u': 'у', 'v': 'в', 'y': 'ъ',
#                         'z': 'з', 'ž': 'ж', 'ź': 'з', 'å': 'а', 'ȯ': 'о', 'ò': 'о', 'ó': 'о', 'ú': 'у', 'ý': 'ъ'},
#         ("isv", "mk"): {'a': 'а', 'b': 'б', 'c': 'ц', 'č': 'ч', 'ć': 'ќ', 'd': 'д', 'ď': 'д', 'd́': 'ѓ', 'e': 'е',
#                         'ě': 'е', 'ė': 'е', 'ę': 'а', 'ě': 'е', 'f': 'ф', 'g': 'г', 'h': 'х', 'i': 'и', 'j': 'ј',
#                         'k': 'к', 'l': 'л', 'ľ': 'љ', 'ĺ': 'љ', 'm': 'м', 'n': 'н', 'ń': 'њ', 'o': 'о', 'p': 'п',
#                         'r': 'р', 's': 'с', 'š': 'ш', 'ś': 'с', 't': 'т', 'ť': 'т', 'u': 'у', 'v': 'в', 'y': 'и',
#                         'z': 'з', 'ž': 'ж', 'ź': 'з', 'å': 'а', 'ȯ': 'о', 'ò': 'о', 'ó': 'о', 'ú': 'у', 'ý': 'и'},
#         ("isv", "sr"): {'a': 'а', 'b': 'б', 'c': 'ц', 'č': 'ч', 'ć': 'ћ', 'd': 'д', 'ď': 'ђ', 'd́': 'ђ', 'e': 'е',
#                         'ě': 'е', 'ė': 'е', 'ę': 'е', 'ě': 'е', 'f': 'ф', 'g': 'г', 'h': 'х', 'i': 'и', 'j': 'ј',
#                         'k': 'к', 'l': 'л', 'ľ': 'љ', 'ĺ': 'љ', 'm': 'м', 'n': 'н', 'ń': 'њ', 'o': 'о', 'p': 'п',
#                         'r': 'р', 's': 'с', 'š': 'ш', 'ś': 'ш', 't': 'т', 'ť': 'т', 'u': 'у', 'v': 'в', 'y': 'и',
#                         'z': 'з', 'ž': 'ж', 'ź': 'ж', 'å': 'а', 'ȯ': 'о', 'ò': 'о', 'ó': 'о', 'ú': 'у', 'ý': 'и'},
#         ("isv", "hr"): {'a': 'a', 'b': 'b', 'c': 'c', 'č': 'č', 'ć': 'ć', 'd': 'd', 'ď': 'đ', 'd́': 'đ', 'e': 'e',
#                         'ě': 'e', 'ė': 'e', 'ę': 'e', 'ě': 'e', 'f': 'f', 'g': 'g', 'h': 'h', 'i': 'i', 'j': 'j',
#                         'k': 'k', 'l': 'l', 'ľ': 'lj', 'ĺ': 'lj', 'm': 'm', 'n': 'n', 'ń': 'nj', 'o': 'o', 'p': 'p',
#                         'r': 'r', 's': 's', 'š': 'š', 'ś': 'š', 't': 't', 'ť': 't', 'u': 'u', 'v': 'v', 'y': 'i',
#                         'z': 'z', 'ž': 'ž', 'ź': 'ž', 'å': 'a', 'ȯ': 'o', 'ò': 'o', 'ó': 'o', 'ú': 'u', 'ý': 'i'},
#         ("isv", "sl"): {'a': 'a', 'b': 'b', 'c': 'c', 'č': 'č', 'ć': 'č', 'd': 'd', 'ď': 'd', 'd́': 'd', 'e': 'e',
#                         'ě': 'e', 'ė': 'e', 'ę': 'e', 'ě': 'e', 'f': 'f', 'g': 'g', 'h': 'h', 'i': 'i', 'j': 'j',
#                         'k': 'k', 'l': 'l', 'ľ': 'l', 'ĺ': 'l', 'm': 'm', 'n': 'n', 'ń': 'nj', 'o': 'o', 'p': 'p',
#                         'r': 'r', 's': 's', 'š': 'š', 'ś': 'š', 't': 't', 'ť': 't', 'u': 'u', 'v': 'v', 'y': 'i',
#                         'z': 'z', 'ž': 'ž', 'ź': 'ž', 'å': 'a', 'ȯ': 'o', 'ò': 'o', 'ó': 'o', 'ú': 'u', 'ý': 'i'},
#         ("isv", "be"): {'a': 'а', 'b': 'б', 'c': 'ц', 'č': 'ч', 'ć': 'ць', 'd': 'д', 'ď': 'дзь', 'd́': 'дзь', 'e': 'е',
#                         'ě': 'е', 'ė': 'е', 'ę': 'я', 'ě': 'е', 'f': 'ф', 'g': 'г', 'h': 'х', 'i': 'і', 'j': 'й',
#                         'k': 'к', 'l': 'л', 'ľ': 'ль', 'ĺ': 'ль', 'm': 'м', 'n': 'н', 'ń': 'нь', 'o': 'о', 'p': 'п',
#                         'r': 'р', 's': 'с', 'š': 'ш', 'ś': 'сь', 't': 'т', 'ť': 'ть', 'u': 'у', 'v': 'в', 'y': 'ы',
#                         'z': 'з', 'ž': 'ж', 'ź': 'зь', 'å': 'а', 'ȯ': 'о', 'ò': 'о', 'ó': 'о', 'ú': 'у', 'ý': 'ы'},
#         ("ru", "isv"): {'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'е': 'e', 'ё': 'e', 'ж': 'ž', 'з': 'z',
#                         'и': 'i', 'й': 'j', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n', 'о': 'o', 'п': 'p', 'р': 'r',
#                         'с': 's', 'т': 't', 'у': 'u', 'ф': 'f', 'х': 'h', 'ц': 'c', 'ч': 'č', 'ш': 'š', 'щ': 'šč',
#                         'ъ': '', 'ы': 'y', 'ь': '', 'э': 'e', 'ю': 'ju', 'я': 'ja'},
#         ("uk", "isv"): {'а': 'a', 'б': 'b', 'в': 'v', 'г': 'h', 'ґ': 'g', 'д': 'd', 'е': 'e', 'є': 'je', 'ж': 'ž',
#                         'з': 'z', 'и': 'y', 'і': 'i', 'ї': 'ji', 'й': 'j', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n',
#                         'о': 'o', 'п': 'p', 'р': 'r', 'с': 's', 'т': 't', 'у': 'u', 'ф': 'f', 'х': 'h', 'ц': 'c',
#                         'ч': 'č', 'ш': 'š', 'щ': 'šč', 'ь': '', 'ю': 'ju', 'я': 'ja'},
#         ("pl", "isv"): {'a': 'a', 'ą': 'ę', 'b': 'b', 'c': 'c', 'ć': 'ć', 'd': 'd', 'e': 'e', 'ę': 'ę', 'f': 'f',
#                         'g': 'g', 'h': 'h', 'i': 'i', 'j': 'j', 'k': 'k', 'l': 'ł', 'ł': 'l', 'm': 'm', 'n': 'n',
#                         'ń': 'ń', 'o': 'o', 'ó': 'u', 'p': 'p', 'r': 'r', 's': 's', 'ś': 'ś', 't': 't', 'u': 'u',
#                         'w': 'v', 'y': 'y', 'z': 'z', 'ź': 'ź', 'ż': 'ž'},
#         ("cs", "isv"): {'a': 'a', 'á': 'a', 'b': 'b', 'c': 'c', 'č': 'č', 'd': 'd', 'ď': 'ď', 'e': 'e', 'é': 'e',
#                         'ě': 'ě', 'f': 'f', 'g': 'g', 'h': 'h', 'i': 'i', 'í': 'i', 'j': 'j', 'k': 'k', 'l': 'l',
#                         'm': 'm', 'n': 'n', 'ň': 'ń', 'o': 'o', 'ó': 'o', 'p': 'p', 'q': 'kv', 'r': 'r', 'ř': 'ŕ',
#                         's': 's', 'š': 'š', 't': 't', 'ť': 'ť', 'u': 'u', 'ú': 'u', 'ů': 'ov', 'v': 'v', 'w': 'v',
#                         'x': 'ks', 'y': 'y', 'ý': 'y', 'z': 'z', 'ž': 'ž'},
#         ("bg", "isv"): {'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'е': 'e', 'ж': 'ž', 'з': 'z', 'и': 'i',
#                         'й': 'j', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n', 'о': 'o', 'п': 'p', 'р': 'r', 'с': 's',
#                         'т': 't', 'у': 'u', 'ф': 'f', 'х': 'h', 'ц': 'c', 'ч': 'č', 'ш': 'š', 'щ': 'št', 'ъ': 'y',
#                         'ь': '', 'ю': 'ju', 'я': 'ja'},
#         ("mk", "isv"): {'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'ѓ': 'ď', 'е': 'e', 'ж': 'ž', 'з': 'z',
#                         'ѕ': 'dz', 'и': 'i', 'ј': 'j', 'к': 'k', 'л': 'l', 'љ': 'ľ', 'м': 'm', 'н': 'n', 'њ': 'ń',
#                         'о': 'o', 'п': 'p', 'р': 'r', 'с': 's', 'т': 't', 'ќ': 'ć', 'у': 'u', 'ф': 'f', 'х': 'h',
#                         'ц': 'c', 'ч': 'č', 'џ': 'dž', 'ш': 'š'},
#         ("sr", "isv"): {'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'ђ': 'đ', 'е': 'e', 'ж': 'ž', 'з': 'z',
#                         'и': 'i', 'ј': 'j', 'к': 'k', 'л': 'l', 'љ': 'ľ', 'м': 'm', 'н': 'n', 'њ': 'ń', 'о': 'o',
#                         'п': 'p', 'р': 'r', 'с': 's', 'т': 't', 'ћ': 'ć', 'у': 'u', 'ф': 'f', 'х': 'h', 'ц': 'c',
#                         'ч': 'č', 'џ': 'dž', 'ш': 'š'},
#         ("hr", "isv"): {'a': 'a', 'b': 'b', 'c': 'c', 'č': 'č', 'ć': 'ć', 'd': 'd', 'đ': 'ď', 'e': 'e', 'f': 'f',
#                        'g': 'g', 'h': 'h', 'i': 'i', 'j': 'j', 'k': 'k', 'l': 'l', 'lj': 'ľ', 'm': 'm', 'n': 'n',
#                        'nj': 'ń', 'o': 'o', 'p': 'p', 'r': 'r', 's': 's', 'š': 'š', 't': 't', 'u': 'u', 'v': 'v',
#                        'z': 'z', 'ž': 'ž'},
#         ("sl", "isv"): {'a': 'a', 'b': 'b', 'c': 'c', 'č': 'č', 'ć': 'ć', 'd': 'd', 'e': 'e', 'f': 'f', 'g': 'g',
#                         'h': 'h', 'i': 'i', 'j': 'j', 'k': 'k', 'l': 'l', 'm': 'm', 'n': 'n', 'o': 'o', 'p': 'p',
#                         'r': 'r', 's': 's', 'š': 'š', 't': 't', 'u': 'u', 'v': 'v', 'z': 'z', 'ž': 'ž'},
#         ("be", "isv"): {'а': 'a', 'б': 'b', 'в': 'v', 'г': 'h', 'д': 'd', 'е': 'e', 'ё': 'e', 'ж': 'ž', 'з': 'z',
#                         'і': 'i', 'й': 'j', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n', 'о': 'o', 'п': 'p', 'р': 'r',
#                         'с': 's', 'т': 't', 'у': 'u', 'ў': 'v', 'ф': 'f', 'х': 'h', 'ц': 'c', 'ч': 'č', 'ш': 'š',
#                         'ы': 'y', 'ь': '', 'э': 'e', 'ю': 'ju', 'я': 'ja'},
#         ("en", "isv"): {'a': 'a', 'b': 'b', 'c': 'c', 'd': 'd', 'e': 'e', 'f': 'f', 'g': 'g', 'h': 'h', 'i': 'i',
#                         'j': 'j', 'k': 'k', 'l': 'l', 'm': 'm', 'n': 'n', 'o': 'o', 'p': 'p', 'q': 'q', 'r': 'r',
#                         's': 's', 't': 't', 'u': 'u', 'v': 'v', 'w': 'w', 'x': 'x', 'y': 'y', 'z': 'z'},
#         # Добавьте другие пары языков по мере необходимости
#     }
